[Killed] ConditionalExpression
main/components/Nav/AppNavbar.js:55:15
               }
           </Nav>
             {
-              currentUser && currentUser.loggedIn && (
-                <>
-                  <Nav.Link as={Link} to="/restaurants">Restaurants</Nav.Link>
-                  <Nav.Link as={Link} to="/ucsbdates">UCSB Dates</Nav.Link>
-                  <Nav.Link as={Link} to="/placeholder">Placeholder</Nav.Link>
-                  {
-          hasRole(currentUser, "ROLE_USER") && (
-            <>
-              <Nav.Link as={Link} to="/recommendationrequests">RecommendationRequests</Nav.Link>
-            </>
-          )
-        }
-                
-                </>
-              )
+              false
               
             }
killedBy: AppNavbar tests renders the ucsbdates link correctly
statusReason: Error: Unable to find an element with the text: UCSB Dates. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Killed] LogicalOperator
main/components/Nav/AppNavbar.js:55:15
               }
           </Nav>
             {
-              currentUser && currentUser.loggedIn && (
-                <>
-                  <Nav.Link as={Link} to="/restaurants">Restaurants</Nav.Link>
-                  <Nav.Link as={Link} to="/ucsbdates">UCSB Dates</Nav.Link>
-                  <Nav.Link as={Link} to="/placeholder">Placeholder</Nav.Link>
-                  {
-          hasRole(currentUser, "ROLE_USER") && (
-            <>
-              <Nav.Link as={Link} to="/recommendationrequests">RecommendationRequests</Nav.Link>
-            </>
-          )
-        }
-                
-                </>
-              )
+              currentUser && currentUser.loggedIn || <>
+                  <Nav.Link as={Link} to="/restaurants">Restaurants</Nav.Link>
+                  <Nav.Link as={Link} to="/ucsbdates">UCSB Dates</Nav.Link>
+                  <Nav.Link as={Link} to="/placeholder">Placeholder</Nav.Link>
+                  {hasRole(currentUser, "ROLE_USER") && <>
+              <Nav.Link as={Link} to="/recommendationrequests">RecommendationRequests</Nav.Link>
+            </>}
+                
+                </>
               
             }
killedBy: AppNavbar tests renders the ucsbdates link correctly
statusReason: Error: Unable to find an element with the text: UCSB Dates. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <nav
      class="navbar navbar-expand-xl navbar-dark bg-dark sticky-top"
      data-testid="AppNavbar"
    >

[Survived] ConditionalExpression
main/components/Nav/AppNavbar.js:61:11
                   <Nav.Link as={Link} to="/ucsbdates">UCSB Dates</Nav.Link>
                   <Nav.Link as={Link} to="/placeholder">Placeholder</Nav.Link>
                   {
-          hasRole(currentUser, "ROLE_USER") && (
-            <>
-              <Nav.Link as={Link} to="/recommendationrequests">RecommendationRequests</Nav.Link>
-            </>
-          )
+          false
         }
                 

[Survived] ConditionalExpression
main/components/Nav/AppNavbar.js:61:11
                   <Nav.Link as={Link} to="/ucsbdates">UCSB Dates</Nav.Link>
                   <Nav.Link as={Link} to="/placeholder">Placeholder</Nav.Link>
                   {
-          hasRole(currentUser, "ROLE_USER") && (
-            <>
-              <Nav.Link as={Link} to="/recommendationrequests">RecommendationRequests</Nav.Link>
-            </>
-          )
+          true
         }
                 
