[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestsForm.js:5:84
 import { useForm } from 'react-hook-form'
 import { useNavigate } from 'react-router-dom';
 
-function RecommendationRequestsForm({ initialContents, submitAction, buttonLabel = "Create" }) {
+function RecommendationRequestsForm({ initialContents, submitAction, buttonLabel = "" }) {
 
     // Stryker disable all
killedBy: RecommendationRequestsForm tests renders correctly
statusReason: Error: Unable to find an element with the text: /Create/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] Regex
main/components/RecommendationRequests/RecommendationRequestsForm.js:19:27
     const navigate = useNavigate();
 
     const testIdPrefix = "RecommendationRequestsForm";
-    const isodate_regex = /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d)/i;
+    const isodate_regex = /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\D{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d)/i;
 
     return (
killedBy: RecommendationRequestsForm tests No Error messsages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] Regex
main/components/RecommendationRequests/RecommendationRequestsForm.js:19:27
     const navigate = useNavigate();
 
     const testIdPrefix = "RecommendationRequestsForm";
-    const isodate_regex = /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d)/i;
+    const isodate_regex = /(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d\.\d+)|(\d{4}-[01]\d-[0-3]\dT[0-2]\d:[0-5]\d:[0-5]\d)|(\d{4}-[01]\d-[0-3]\dT[0-2]\D:[0-5]\d)/i;
 
     return (
killedBy: RecommendationRequestsForm tests No Error messsages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestsForm.js:93:59
                             id="dateRequested"
                             type="datetime-local"
                             isInvalid={Boolean(errors.dateRequested)}
-                            {...register("dateRequested", { required: "DateRequested is required.", pattern: isodate_regex })}
+                            {...register("dateRequested", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestsForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /DateRequested is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
