[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestsTable.js:47:9
             Header: 'Explanation',
             accessor: 'explanation',
         },
-        {
-            Header: 'DateRequested',
-            accessor: 'localDateTime',
-        },
+        {},
         {
             Header: 'DateNeeded',
killedBy: RecommendationRequestsTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestsTable.js:53:23
         },
         {
             Header: 'DateNeeded',
-            accessor: 'localTimeDate',
+            accessor: "",
         },
         {
killedBy: RecommendationRequestsTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestsTable-cell-row-0-col-localTimeDate"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] BlockStatement
main/components/RecommendationRequests/RecommendationRequestsTable.js:61:45
         }
     ];
 
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-        columns.push(ButtonColumn("Edit", "primary", editCallback, "RecommendationRequestsTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "RecommendationRequestsTable"));
-    } 
+    if (hasRole(currentUser, "ROLE_ADMIN")) {} 
 
     return <OurTable
killedBy: RecommendationRequestsTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="RecommendationRequestsTable-cell-row-0-col-Edit-button"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestsTable.js:63:35
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, "RecommendationRequestsTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "RecommendationRequestsTable"));
+        columns.push(ButtonColumn("", "danger", deleteCallback, "RecommendationRequestsTable"));
     } 
 
killedBy: RecommendationRequestsTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestsTable.js:63:45
 
     if (hasRole(currentUser, "ROLE_ADMIN")) {
         columns.push(ButtonColumn("Edit", "primary", editCallback, "RecommendationRequestsTable"));
-        columns.push(ButtonColumn("Delete", "danger", deleteCallback, "RecommendationRequestsTable"));
+        columns.push(ButtonColumn("Delete", "", deleteCallback, "RecommendationRequestsTable"));
     } 
 
killedBy: RecommendationRequestsTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn
