[Killed] BlockStatement
main/pages/RecommendationRequests/RecommendationRequestsIndexPage.js:3:59
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function RecommendationRequestsIndexPage() {
-
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Index page not yet implemented</h1>
-        <p><a href="/recommendationrequests/create">Create</a></p>
-        <p><a href="/recommendationrequests/edit/1">Edit</a></p>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function RecommendationRequestsIndexPage() {}
 
killedBy: RecommendationRequestsIndexPage tests Renders expected content
statusReason: Error: RecommendationRequestsIndexPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
