[Killed] BooleanLiteral
main/components/Articles/ArticlesForm.js:58:49
               id="title"
               type="text"
               isInvalid={Boolean(errors.title)}
-              {...register("title", { required: true })}
+              {...register("title", { required: false })}
             />
             <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Title is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:61:16
               {...register("title", { required: true })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.title && "Title is required. "}
+              {false}
               {/* {errors.quarterYYYYQ?.type === 'pattern' && 'QuarterYYYYQ must be in the format YYYYQ, e.g. 20224 for Fall 2022'} */}
             </Form.Control.Feedback>
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: Error: Unable to find an element with the text: /Title is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Articles/ArticlesForm.js:61:16
               {...register("title", { required: true })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.title && "Title is required. "}
+              {errors.title || "Title is required. "}
               {/* {errors.quarterYYYYQ?.type === 'pattern' && 'QuarterYYYYQ must be in the format YYYYQ, e.g. 20224 for Fall 2022'} */}
             </Form.Control.Feedback>
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:80:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateAdded && "DateAdded is required."}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /DateAdded is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:99:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.url && "URL is required."}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /URL is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:99:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.url && "URL is required."}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /URL is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:116:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.explanation && "Explanation is required. "}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Explanation is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/Articles/ArticlesForm.js:116:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.explanation && "Explanation is required. "}
+              {errors.explanation || "Explanation is required. "}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:134:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.email && "Email is required."}
+              {true}
               {errors.email?.type === "pattern" && "Email must be in the format a@a.aa"}
             </Form.Control.Feedback>
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:134:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.email && "Email is required."}
+              {false}
               {errors.email?.type === "pattern" && "Email must be in the format a@a.aa"}
             </Form.Control.Feedback>
killedBy: ArticlesForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/Articles/ArticlesForm.js:135:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.email && "Email is required."}
-              {errors.email?.type === "pattern" && "Email must be in the format a@a.aa"}
+              {errors.email.type === "pattern" && "Email must be in the format a@a.aa"}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ArticlesForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
main/components/Articles/ArticlesForm.js:135:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.email && "Email is required."}
-              {errors.email?.type === "pattern" && "Email must be in the format a@a.aa"}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ArticlesForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /Email must be in the format a@a.aa/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
