[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsCreatePage.js:3:64
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function UCSBDiningCommonsMenuItemsCreatePage() {
-
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function UCSBDiningCommonsMenuItemsCreatePage() {}
 
killedBy: UCSBDiningCommonsMenuItemsCreatePage tests Renders expected content
statusReason: Error: UCSBDiningCommonsMenuItemsCreatePage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
