[Killed] LogicalOperator
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsForm.js:35:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="UCSBDiningCommonsMenuItemsForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {initialContents || <Col>
+                        <Form.Group className="mb-3">
+                            <Form.Label htmlFor="id">Id</Form.Label>
+                            <Form.Control data-testid="UCSBDiningCommonsMenuItemsForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+                        </Form.Group>
+                    </Col>}
 
                 <Col>
killedBy: UCSBDiningCommonsMenuItemsCreatePage tests renders without crashing
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsForm.js:35:18
 
             <Row>
 
-                {initialContents && (
-                    <Col>
-                        <Form.Group className="mb-3" >
-                            <Form.Label htmlFor="id">Id</Form.Label>
-                            <Form.Control
-                                data-testid="UCSBDiningCommonsMenuItemsForm-id"
-                                id="id"
-                                type="text"
-                                {...register("id")}
-                                value={initialContents.id}
-                                disabled
-                            />
-                        </Form.Group>
-                    </Col>
-                )}
+                {true}
 
                 <Col>
killedBy: UCSBDiningCommonsMenuItemsForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemsForm-id"]

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsForm.js:59:75
                             id="diningCommonsCode"
                             type="text"
                             isInvalid={Boolean(errors.diningCommonsCode)}
-                            {...register("diningCommonsCode", { required: "Dining Commons Code is required."})}
+                            {...register("diningCommonsCode", { required: ""})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: UCSBDiningCommonsMenuItemsForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Dining Commons Code is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsForm.js:92:42
                             id="station"
                             type="text"
                             isInvalid={Boolean(errors.station)}
-                            {...register("station", { required: "Station is required."})}
+                            {...register("", { required: "Station is required."})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: UCSBDiningCommonsMenuItemsForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsForm.js:92:65
                             id="station"
                             type="text"
                             isInvalid={Boolean(errors.station)}
-                            {...register("station", { required: "Station is required."})}
+                            {...register("station", { required: ""})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: UCSBDiningCommonsMenuItemsForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Station is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
