[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsTable.js:12:20
 export default function UCSBDiningCommonsMenuItemsTable({
     ucsbDiningCommonsMenuItems,
     currentUser,
-    testIdPrefix = "UCSBDiningCommonsMenuItemsTable" }) {
+    testIdPrefix = "" }) {
 
     const navigate = useNavigate();
killedBy: UCSBDiningCommonsMenuItemsTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemsTable-cell-row-0-col-id"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
