[Killed] BlockStatement
main/components/UCSBOrganization/UCSBOrganizationTable.js:16:36
 
     const navigate = useNavigate();
 
-    const editCallback = (cell) => {
-        navigate(`/ucsbOrganization/edit/${cell.row.values.orgCode}`)
-    }
+    const editCallback = (cell) => {}
 
     // Stryker disable all : hard to test for query caching
killedBy: UCSBOrganizationTable tests Edit button navigates to the edit page
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/ucsbOrganization/edit/SKY"

Number of calls: 0

<html>
  <head />
