[Killed] BooleanLiteral
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsCreatePage.js:7:73
 import { useBackendMutation } from "main/utils/useBackend";
 import { toast } from "react-toastify";
 
-export default function UCSBDiningCommonsMenuItemsCreatePage({storybook=false}) {
+export default function UCSBDiningCommonsMenuItemsCreatePage({storybook=true}) {
 
   const objectToAxiosParams = (ucsbDiningCommonsMenuItems) => ({
killedBy: UCSBDiningCommonsMenuItemsCreatePage tests on submit, makes request to backend, and redirects to /ucsbdiningcommonsmenuitems
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/ucsbdiningcommonsmenuitems"}

Number of calls: 0

[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsCreatePage.js:9:31
 
 export default function UCSBDiningCommonsMenuItemsCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (ucsbDiningCommonsMenuItems) => ({
-    url: "/api/ucsbdiningcommonsmenuitems/post",
-    method: "POST",
-    params: {
-     diningCommonsCode: ucsbDiningCommonsMenuItems.diningCommonsCode,
-     name: ucsbDiningCommonsMenuItems.name,
-     station: ucsbDiningCommonsMenuItems.station
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (ucsbDiningCommonsMenuItems) => {
killedBy: UCSBDiningCommonsMenuItemsCreatePage tests on submit, makes request to backend, and redirects to /ucsbdiningcommonsmenuitems
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsCreatePage.js:19:53
     }
   });
 
-  const onSuccess = (ucsbDiningCommonsMenuItems) => {
-    toast(`New UCSBDiningCommonsMenuItems Created - id: ${ucsbDiningCommonsMenuItems.id} diningCommonsCode: ${ucsbDiningCommonsMenuItems.diningCommonsCode}`);
-  }
+  const onSuccess = (ucsbDiningCommonsMenuItems) => {}
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemsCreatePage tests on submit, makes request to backend, and redirects to /ucsbdiningcommonsmenuitems
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New UCSBDiningCommonsMenuItems Created - id: 1 diningCommonsCode: carillo"

Number of calls: 0
