[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.js:12:24
         formState: { errors },
         handleSubmit,
     } = useForm({
-        defaultValues: initialContents || {},
+        defaultValues: true,
     });
 
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot create property 'orgCode' on boolean 'true'

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:43:45
                     id="orgCode"
                     type="text"
                     isInvalid={Boolean(errors.orgCode)}
-                    {...register("orgCode", {
-                        required: "Organization Code is required.",
-                    })}
+                    {...register("orgCode", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Organization Code is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:59:57
                     id="orgTranslationShort"
                     type="text"
                     isInvalid={Boolean(errors.orgTranslationShort)}
-                    {...register("orgTranslationShort", {
-                        required: "Organization Translation Short is required.",
-                    })}
+                    {...register("orgTranslationShort", {})}
                 />
                 <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Organization Translation Short is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:89:34
                     type="checkbox"
                     label="Inactive"
                     id="inactive"
-                    {...register("inactive")}
+                    {...register("")}
                 />
             </Form.Group>
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
