[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsEditPage.js:3:62
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function UCSBDiningCommonsMenuItemsEditPage() {
-
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Edit page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  )
-}
+export default function UCSBDiningCommonsMenuItemsEditPage() {}
 
killedBy: UCSBDiningCommonsMenuItemsEditPage tests Renders expected content
statusReason: Error: UCSBDiningCommonsMenuItemsEditPage(...): Nothing was returned from render. This usually means a return statement is missing. Or, to render nothing, return null.
