[Survived] BlockStatement
src/main/utils/UCSBOrganizationUtils.js:8:47
     toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/ucsbOrganization",
-        method: "DELETE",
-        params: {
-            id: cell.row.values.id
-        }
-    }
-}
+export function cellToAxiosParamsDelete(cell) {}
 

[Survived] ObjectLiteral
src/main/utils/UCSBOrganizationUtils.js:9:12
 }
 
 export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/ucsbOrganization",
-        method: "DELETE",
-        params: {
-            id: cell.row.values.id
-        }
-    }
+    return {}
 }
 

[Survived] StringLiteral
src/main/utils/UCSBOrganizationUtils.js:11:17
 export function cellToAxiosParamsDelete(cell) {
     return {
         url: "/api/ucsbOrganization",
-        method: "DELETE",
+        method: "",
         params: {
             id: cell.row.values.id
