[Killed] StringLiteral
src/main/utils/ucsbDiningCommonsMenuItemsUtils.js:11:17
 export function cellToAxiosParamsDelete(cell) {
     return {
         url: "/api/ucsbdiningcommonsmenuitems",
-        method: "DELETE",
+        method: "",
         params: {
             id: cell.row.values.id
killedBy: UCSBDiningCommonsMenuItemsUtils cellToAxiosParamsDelete should return axios parameters for a DELETE request
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "method": "DELETE",
+   "method": "",
