[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:15:13
         useBackend(
             // Stryker disable next-line all : don't test internal caching of React Query
             [`/api/ucsborganization?orgCode=${orgCode}`],
-            {  // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
-                method: "GET",
-                url: `/api/ucsborganization`,
-                params: {
-                    code: orgCode
-                }
-            }
+            {}
         );
 
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:18:25
             {  // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
                 method: "GET",
                 url: `/api/ucsborganization`,
-                params: {
-                    code: orgCode
-                }
+                params: {}
             }
         );
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
      <nav

[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:24:36
             }
         );
 
-    const objectToAxiosPutParams = (ucsbOrganization) => ({
-        url: "/api/ucsborganization",
-        method: "PUT",
-        params: {
-            code: ucsbOrganization.orgCode,
-            
-        },
-        data: {
-            orgCode: ucsbOrganization.orgCode,
-            orgTranslationShort: ucsbOrganization.orgTranslationShort,
-            orgTranslation: ucsbOrganization.orgTranslation,
-            inactive: ucsbOrganization.inactive,
-        }
-    });
+    const objectToAxiosPutParams = () => undefined;
 
     const onSuccess = (ucsbOrganization) => {
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBOrganization Updated - orgCode: SKY orgTranslationShort: SKYDIVING CLUB orgTranslation: SKYDIVING CLUB AT UCSB inactive: false"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:27:17
     const objectToAxiosPutParams = (ucsbOrganization) => ({
         url: "/api/ucsborganization",
         method: "PUT",
-        params: {
-            code: ucsbOrganization.orgCode,
-            
-        },
+        params: {},
         data: {
             orgCode: ucsbOrganization.orgCode,
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "code": "SKY",
- }

[Killed] LogicalOperator
main/pages/UCSBOrganization/UCSBOrganizationEditPage.js:65:21
             <div className="pt-2">
                 <h1>Edit UCSBOrganization</h1>
                 {
-                    ucsbOrganization && <UCSBOrganizationForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={ucsbOrganization} />
+                    ucsbOrganization || <UCSBOrganizationForm submitAction={onSubmit} buttonLabel={"Update"} initialContents={ucsbOrganization} />
                 }
             </div>
killedBy: UCSBOrganizationEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

<body>
  <div />
</body>
