[Killed] BlockStatement
src/main/utils/UCSBOrganizationUtils.js:8:47
     toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/ucsborganization",
-        method: "DELETE",
-        params: {
-            code: cell.row.values.orgCode
-        }
-    }
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: UCSBOrganizationIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBOrganization with id SKY was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
src/main/utils/UCSBOrganizationUtils.js:9:12
 }
 
 export function cellToAxiosParamsDelete(cell) {
-    return {
-        url: "/api/ucsborganization",
-        method: "DELETE",
-        params: {
-            code: cell.row.values.orgCode
-        }
-    }
+    return {}
 }
 
killedBy: UCSBOrganizationIndexPage tests what happens when you click delete, admin
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBOrganization with id SKY was deleted"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2
