[Killed] ArrowFunction
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.js:9:31
 
 export default function UCSBOrganizationCreatePage({storybook=false}) {
 
-  const objectToAxiosParams = (ucsbOrganization) => ({
-    url: "/api/ucsborganization/post",
-    method: "POST",
-    params: {
-     orgCode: ucsbOrganization.orgCode,
-     orgTranslationShort: ucsbOrganization.orgTranslationShort,
-     orgTranslation: ucsbOrganization.orgTranslation,
-     inactive: ucsbOrganization.inactive
-    }
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (ucsbOrganization) => {
killedBy: UCSBOrganizationCreatePage tests on submit, makes request to backend, and redirects to /ucsborganization
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

<html>
  <head />
  <body>
