[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:75:34
                     label="Inactive"
                     id="inactive"
                     data-testid={testIdPrefix + "-inactive"}
-                    {...register("inactive")}
+                    {...register("")}
                 />
             </Form.Group>
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
